[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:45:13
     private static bool IsOverloadingEqualsOperator(this ITypeSymbol typeSymbol, SyntaxNodeAnalysisContext context, SyntaxKind operatorKind)
     {
         // If the type is a nullable struct.
-        if (!typeSymbol.IsReferenceType && typeSymbol.NullableAnnotation == NullableAnnotation.Annotated)
+        if (typeSymbol.IsReferenceType && typeSymbol.NullableAnnotation == NullableAnnotation.Annotated)
         {
             INamedTypeSymbol NamedTypeSymbol = (INamedTypeSymbol)typeSymbol;
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_NoDiagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.NullableStructEqualsEqualsOperator_Diagnostic

[Killed] Logical mutation
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:45:13
     private static bool IsOverloadingEqualsOperator(this ITypeSymbol typeSymbol, SyntaxNodeAnalysisContext context, SyntaxKind operatorKind)
     {
         // If the type is a nullable struct.
-        if (!typeSymbol.IsReferenceType && typeSymbol.NullableAnnotation == NullableAnnotation.Annotated)
+        if (!typeSymbol.IsReferenceType || typeSymbol.NullableAnnotation == NullableAnnotation.Annotated)
         {
             INamedTypeSymbol NamedTypeSymbol = (INamedTypeSymbol)typeSymbol;
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_NoDiagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.StructEqualsEqualsOperator_NoDiagnostic

[Killed] Block removal mutation
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:46:9
     {
         // If the type is a nullable struct.
         if (!typeSymbol.IsReferenceType && typeSymbol.NullableAnnotation == NullableAnnotation.Annotated)
-        {
-            INamedTypeSymbol NamedTypeSymbol = (INamedTypeSymbol)typeSymbol;
-            INamedTypeSymbol OriginalDefinition = Contract.AssertNotNull(NamedTypeSymbol.OriginalDefinition);
-
-            Contract.Assert(OriginalDefinition.SpecialType == SpecialType.System_Nullable_T);
-
-            // Get the original struct type. This is the type to inspect for overloaded operators.
-            typeSymbol = NamedTypeSymbol.TypeArguments[0];
-        }
+        {}
 
         ImmutableArray<ISymbol> Symbols = typeSymbol.GetMembers();
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.NullableStructEqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.NullableStructExclamationEqualsOperator_NoDiagnostic

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:59:17
         ImmutableArray<ISymbol> Symbols = typeSymbol.GetMembers();
 
         foreach (ISymbol Symbol in Symbols)
-            if (!Symbol.IsImplicitlyDeclared && Symbol.IsOperatorOverload(context, operatorKind))
+            if (Symbol.IsImplicitlyDeclared && Symbol.IsOperatorOverload(context, operatorKind))
                 return true;
 
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_NoDiagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.NullableStructEqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.ExclamationEqualsOperator_NoDiagnostic

[Killed] Negate expression
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:59:17
         ImmutableArray<ISymbol> Symbols = typeSymbol.GetMembers();
 
         foreach (ISymbol Symbol in Symbols)
-            if (!Symbol.IsImplicitlyDeclared && Symbol.IsOperatorOverload(context, operatorKind))
+            if (!(!Symbol.IsImplicitlyDeclared && Symbol.IsOperatorOverload(context, operatorKind)))
                 return true;
 
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.ExclamationEqualsOperator_Diagnostic; RoslynHelpers.Test.TypeHelperTest.EqualsEqualsExpression_Diagnostic

[Killed] Boolean mutation
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:60:24
 
         foreach (ISymbol Symbol in Symbols)
             if (!Symbol.IsImplicitlyDeclared && Symbol.IsOperatorOverload(context, operatorKind))
-                return true;
+                return false;
 
         return false;
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_NoDiagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.NullableStructEqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.ExclamationEqualsOperator_NoDiagnostic

[Survived] Negate expression
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:71:17
         {
             SyntaxNode Declaration = SyntaxReference.GetSyntax(context.CancellationToken);
 
-            if (Declaration is OperatorDeclarationSyntax OperatorDeclaration && OperatorDeclaration.OperatorToken.IsKind(operatorKind))
+            if (!(Declaration is OperatorDeclarationSyntax OperatorDeclaration && OperatorDeclaration.OperatorToken.IsKind(operatorKind)))
                 return true;
         }

[Timeout] Boolean mutation
Projects/RoslynHelpers/RoslynHelpers/OperatorOverloadHelper.cs:72:24
             SyntaxNode Declaration = SyntaxReference.GetSyntax(context.CancellationToken);
 
             if (Declaration is OperatorDeclarationSyntax OperatorDeclaration && OperatorDeclaration.OperatorToken.IsKind(operatorKind))
-                return true;
+                return false;
         }
 
