[Killed] Block removal mutation
Projects/RoslynHelpers/RoslynHelpers/TypeHelper.cs:21:5
     /// <param name="context">The analysis context.</param>
     /// <returns>The type of <paramref name="expression"/>if a valid type; otherwise, <see langword="null"/>.</returns>
     public static ITypeSymbol? GetExpressionValidType(this ExpressionSyntax expression, SyntaxNodeAnalysisContext context)
-    {
-        TypeInfo ExpressionTypeInfo = context.SemanticModel.GetTypeInfo(expression, context.CancellationToken);
-
-        return IsTypeSymbolAndNotError(ExpressionTypeInfo, out ITypeSymbol ValidResult)
-            ? ValidResult
-            : null;
-    }
+    {}
 
     /// <summary>
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.ArrayEqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.ExclamationEqualsOperator_Diagnostic

[Killed] Block removal mutation
Projects/RoslynHelpers/RoslynHelpers/TypeHelper.cs:36:5
     /// <param name="context">The analysis context.</param>
     /// <returns>The type of <paramref name="type"/>if a valid type; otherwise, <see langword="null"/>.</returns>
     public static ITypeSymbol? GetTypeValidType(this TypeSyntax type, SyntaxNodeAnalysisContext context)
-    {
-        TypeInfo TypeTypeInfo = context.SemanticModel.GetTypeInfo(type, context.CancellationToken);
-
-        return IsTypeSymbolAndNotError(TypeTypeInfo, out ITypeSymbol ValidResult)
-            ? ValidResult
-            : null;
-    }
+    {}
 
     private static bool IsTypeSymbolAndNotError<T>(TypeInfo typeInfo, out T result)
killedBy: RoslynHelpers.Test.TypeHelperTest.IntType_Diagnostic

[Killed] Boolean mutation
Projects/RoslynHelpers/RoslynHelpers/TypeHelper.cs:52:20
         if (Type is T ValidResult and not IErrorTypeSymbol)
         {
             result = ValidResult;
-            return true;
+            return false;
         }
 
killedBy: RoslynHelpers.Test.OperatorOverloadHelperTest.EqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.ArrayEqualsEqualsOperator_Diagnostic; RoslynHelpers.Test.OperatorOverloadHelperTest.ExclamationEqualsOperator_Diagnostic

[Survived] Boolean mutation
Projects/RoslynHelpers/RoslynHelpers/TypeHelper.cs:56:16
         }
 
         Contract.Unused(out result);
-        return false;
+        return true;
     }
 }
